app/views/users/show.html.erb

SELECT "microposts".* FROM "microposts"  WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
<strong>Microposts:</strong></br>
<% @user.microposts.each do |micropost| %>